In [1]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv('Dataset for Pandas Assinment/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [3]:
titles.shape

(244914, 2)

### What are the earliest two films listed in the titles dataframe?

In [4]:
titles.sort_values(by='year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [5]:
(titles['title'] == 'Hamlet').sum()

20

### How many movies are titled "North by Northwest"?

In [6]:
(titles['title'] == 'North by Northwest').sum()

1

### When was the first movie titled "Hamlet" made?

In [7]:
titles[titles['title'] == 'Hamlet'].sort_values(by='year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [8]:
titles[titles['title'] == 'Treasure Island'].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [9]:
(titles['year'] == 1950).sum()

1113

### How many movies were made in the year 1960?

In [10]:
(titles['year'] == 1960).sum()

1549

### How many movies were made from 1950 through 1959?

In [11]:
(titles['year'].between(1950,1959, inclusive=True)).sum()

12934

### In what years has a movie titled "Batman" been released?

In [12]:
titles[titles['title'] == 'Batman']['year']

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [13]:
cast = pd.read_csv("~/abhishekMain/Work/LetsUpgrade/new stuffs/Day16-17/Dataset for Pandas Assinment-20200731T143616Z-001/Dataset for Pandas Assinment/cast.csv")

In [14]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [15]:
cast[cast['title'] == 'Inception']['character'].count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
cast[(cast['title'] == 'Inception') & (cast['n'].isna())]['character'].count()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
cast[(cast['title'] == 'Inception') & (cast['n'].notna())]['character'].count()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
cast[(cast['title'] == 'North by Northwest') & (cast['n'].notna())].sort_values(by='n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 1972)].sort_values('n')['name']

1705394      Laurence Olivier
326773          Michael Caine
373876         Alec Cawthorne
1465483    John (II) Matthews
2724553    Eve (III) Channing
1448690          Teddy Martin
Name: name, dtype: object

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [20]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 2007)].sort_values('n')['name']

326774           Michael Caine
1293634               Jude Law
1805907          Harold Pinter
260242         Kenneth Branagh
373877     Alec (II) Cawthorne
2724552      Eve (II) Channing
3370424      Carmel O'Sullivan
Name: name, dtype: object

### How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)]['character'].count()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [22]:
cast[(cast['title'] == "Hamlet") & (cast['year'] == 1996)]['character'].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [23]:
(cast['character'] == 'Hamlet').sum()

96

### How many people have played an "Ophelia"?

In [24]:
(cast['character'] == 'Ophelia').sum()

117

### How many people have played a role called "The Dude"?

In [25]:
(cast['character'] == 'The Dude').sum()

19

### How many people have played a role called "The Stranger"?

In [26]:
(cast['character'] == 'The Stranger').sum()

212

### How many roles has Sidney Poitier played throughout his career?

In [27]:
cast[cast['name'] == 'Sidney Poitier']['character'].count()

43

### How many roles has Judi Dench played?

In [28]:
cast[cast['name'] == 'Judi Dench']['character'].count()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [29]:
cast[(cast['name'] == 'Cary Grant') & (cast['n'] == 2) & cast['year'].between(1940,1950)]['character']

871423     Nick Arden
871433    Roger Adams
Name: character, dtype: object

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [30]:
cast[(cast['n'] == 1) & (cast['name'] == 'Cary Grant') & cast['year'].between(1940,1950)]['character']

871390                       Mortimer Brewster
871396             Dr. Eugene Norland Ferguson
871398                           Capt. Cassidy
871402                       Dr. Madison Brown
871407                            Walter Burns
871411                   Captain Henri Rochard
871421                           Jim Blandings
871422    Joe Adams -posing as Joe Bascopolous
871424                             Cole Porter
871425                              Ernie Mott
871427                                  Devlin
871429                   Patrick 'Pat' O'Toole
871430                             Jerry Flynn
871438                        Johnnie Aysgarth
871444                             Dick Nugent
871445                                  Dudley
871448                             Matt Howard
871450                      C. K. Dexter Haven
871452                            Leopold Dilg
Name: character, dtype: object

### How many roles were available for actors in the 1950s?

In [31]:
cast[(cast['year'].between(1950,1959, inclusive=True)) & (cast['type'] == 'actor')]['character'].count()

157738

### How many roles were available for actresses in the 1950s?

In [32]:
cast[(cast['year'].between(1950,1959, inclusive=True)) & (cast['type'] == 'actress')]['character'].count()

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [33]:
cast[(cast['n'] == 1) & (cast['year'] <= 1980)]['character'].count()

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [34]:
cast[(cast['n'] == 2) & (cast['year'] <= 1980)]['character'].count()

61395

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [35]:
cast[(cast['n'].isna()) & (cast['year'] <= 1980)]['character'].count()

448347